<?php
	if (empty($_POST['FName']))
	{
		echo "Имя не введено"."<br>";
	}
	else
	{
		echo "Имя ".$_POST['FName']."<br>";
	}
/////////////////////////////////////////////
	if (empty($_POST["SName"]))
	{
		echo "Фамилия не введена"."<br>";
	}
	else
	{
		echo "Фамилия ".$_POST["SName"]."<br>";
	}
//////////////////////////////////////////////
	if (isset($_POST["bdate"]))
	{
		echo "Дата рождения ".$_POST["bdate"]."<br>";
	}
	else
	{
		echo "Дата рождения не введена";
	}
/////////////////////////////////////////////////
	if (isset($_POST["gender"]))
	{
		echo "Пол ".$_POST["gender"]."<br>";
	}
	else
	{
		echo "Пол не выбран";
	}
///////////////////////////////////////////////////
	$article = $_POST['var'];
	if(empty($article))
	{
		echo "Интересные рубрики не выбраны";
	}
	else
	{
		$k = count($article);
		echo ("Выбрано следующие рубрики: "."<br>");
		for ($i=0; $i<$k; $i++)
		{
			echo ("$article[$i]"."  ");
		}
	}
//////////////////////////////////////////////////
	$comm = $_POST['comment'];
	if (empty($comm))
	{
		echo "<br>"."Нет комментария"."<br>";
	}
	else
	{
		echo ("<br>"."Комментарий: "."<br>"."$comm"."<br>");
	}
/////////////////////////////////////////////////////
	$email = $_POST['email'];
    if (empty($email))
	{
		echo "Не введена почта"."<br>";
	}
	else
	{
		echo "Электронная почта "."$email"."<br>";
	}
///////////////////////////////////////////////////////
	$passw = $_POST['passw1'];
	if (empty($passw))
	{
		echo "Не введен пароль"."<br>";
	}
	else
	{
		echo "Пароль "."$passw"."<br>";
	}
?>